<a href="https://colab.research.google.com/github/DSF-Kotaro/classroom/blob/main/%E3%80%90%E7%AC%AC12%E5%9B%9E%E3%80%91%E5%9F%BA%E6%9C%AC%E7%9A%84%E3%81%AA%E3%83%87%E3%83%BC%E3%82%BF%E6%93%8D%E4%BD%9C.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#ライブラリの読み込み（load libraries）

In [1]:
import numpy as np
import numpy.random as random
import scipy as sp
import pandas as pd
from pandas import Series, DataFrame

import matplotlib.pyplot as plt
import matplotlib as mpl
import seaborn as sns

np.random.seed(0)

#データフレームの作成（Creating a data frame）

In [6]:
hier_df = DataFrame(
    np.arange(9).reshape((3,3)),
    index = [
             ['a','a','b'],
             [1,2,2]
    ],
    columns = [
              ['Osaka','Tokyo','Osaka'],
              ['Blue','Red','Red']
    ]
)

hier_df

    Osaka Tokyo Osaka
     Blue   Red   Red
a 1     0     1     2
  2     3     4     5
b 2     6     7     8

##インデックスとカラムに名前を付ける（Name indexes and columns）

In [8]:
#Name indexes
hier_df.index.names = ['key1','key2']

#Name columns
hier_df.columns.names = ['city','color']

hier_df

city      Osaka Tokyo Osaka
color      Blue   Red   Red
key1 key2
a    1        0     1     2
     2        3     4     5
b    2        6     7     8

##カラムの絞り込み（Column refinement）

In [9]:
hier_df['Osaka']

color      Blue  Red
key1 key2
a    1        0    2
     2        3    5
b    2        6    8

In [10]:
hier_df['Tokyo']

color      Red
key1 key2
a    1       1
     2       4
b    2       7

##インデックスを軸にした集計（Aggregation on the index）

In [12]:
hier_df.sum(level = 'key1', axis = 0)

city  Osaka Tokyo Osaka
color  Blue   Red   Red
key1
a         3     5     7
b         6     7     8

In [13]:
hier_df.sum(level = 'key2', axis = 0)

city  Osaka Tokyo Osaka
color  Blue   Red   Red
key2
1         0     1     2
2         9    11    13

In [15]:
hier_df.sum(level = 'city', axis = 1)

city       Osaka  Tokyo
key1 key2
a    1         2      1
     2         8      4
b    2        14      7

In [14]:
hier_df.sum(level = 'color', axis = 1)

color      Blue  Red
key1 key2
a    1        0    3
     2        3    9
b    2        6   15

##インデックスの要素の削除（Delete index element）

In [16]:
hier_df.drop(['b'])

city      Osaka Tokyo Osaka
color      Blue   Red   Red
key1 key2
a    1        0     1     2
     2        3     4     5

#問題（Question）

##問題１（Question１）
次のデータに対して、Kyotoの列だけを抜き出しなさい
<br>
Extract only Kyoto columns for the following data

In [17]:
hier_df1 = DataFrame(
    np.arange(12).reshape((3,4)),
    index = [
             ['c','d','d'],
             [1,2,1]
    ],
    columns = [
              ['Kyoto','Nagoya','Hokkaido','Kyoto'],
              ['Yellow','Yellow','Red','Blue']
    ]
)

hier_df1.index.names = ['key1','key2']
hier_df1.columns.names = ['city','color']

hier_df

city      Osaka Tokyo Osaka
color      Blue   Red   Red
key1 key2
a    1        0     1     2
     2        3     4     5
b    2        6     7     8

In [ ]:
#ANSWR

#問題２（Question 2）<br>
問題１のデータに対して、cityをまとめて列同士の平均値を出しなさい。<br>For the data of Problem 1, put together the cities and calculate the average value between the columns.

#問題３（Question ３）
<br>問題１のデータに対して、key2ごとに行の合計を算出しなさい。
<br>Calculate the total number of rows for each key2 for the data in question 1.

#データの結合（Combine data）

##データセット（Dataset）

In [18]:
data1 = {
    'id':['100','101','102','103','104','106','108','110','111','113'],
    'city':['Tokyo','Osaka','Kyoto','Hokkaido','Tokyo','Tokyo','Osaka','Kyoto','Hokkaido','Tokyo'],
    'birth_year':['1990','1989','1992','1997','1982','1991','1988','1990','1995','1981'],
    'name':['Hiroshi','Akiko','Yuki','Satoru','Steeve','Mituru','Aoi','Tarou','Suguru','Mitsuo']
}

df1 = DataFrame(data1)
df1

    id      city birth_year     name
0  100     Tokyo       1990  Hiroshi
1  101     Osaka       1989    Akiko
2  102     Kyoto       1992     Yuki
3  103  Hokkaido       1997   Satoru
4  104     Tokyo       1982   Steeve
5  106     Tokyo       1991   Mituru
6  108     Osaka       1988      Aoi
7  110     Kyoto       1990    Tarou
8  111  Hokkaido       1995   Suguru
9  113     Tokyo       1981   Mitsuo

In [19]:
data2 = {
    'id':['100','101','102','105','107'],
    'math':[50,43,33,76,98],
    'english':[90,30,20,50,30],
    'sex':['M','F','F','M','M'],
    'index_num':[0,1,2,3,4]
}

df2 = DataFrame(data2)
df2

    id  math  english sex  index_num
0  100    50       90   M          0
1  101    43       30   F          1
2  102    33       20   F          2
3  105    76       50   M          3
4  107    98       30   M          4

##内部結合（Inner join）

In [20]:
print('Inner Join')
pd.merge(df1,df2, on = 'id')

Inner Join

    id   city birth_year     name  math  english sex  index_num
0  100  Tokyo       1990  Hiroshi    50       90   M          0
1  101  Osaka       1989    Akiko    43       30   F          1
2  102  Kyoto       1992     Yuki    33       20   F          2

##全結合（Fully integrated）

In [21]:
print('Fully integrated')
pd.merge(df1,df2, how = 'outer')

Fully integrated

     id      city birth_year     name  math  english  sex  index_num
0   100     Tokyo       1990  Hiroshi  50.0     90.0    M        0.0
1   101     Osaka       1989    Akiko  43.0     30.0    F        1.0
2   102     Kyoto       1992     Yuki  33.0     20.0    F        2.0
3   103  Hokkaido       1997   Satoru   NaN      NaN  NaN        NaN
4   104     Tokyo       1982   Steeve   NaN      NaN  NaN        NaN
5   106     Tokyo       1991   Mituru   NaN      NaN  NaN        NaN
6   108     Osaka       1988      Aoi   NaN      NaN  NaN        NaN
7   110     Kyoto       1990    Tarou   NaN      NaN  NaN        NaN
8   111  Hokkaido       1995   Suguru   NaN      NaN  NaN        NaN
9   113     Tokyo       1981   Mitsuo   NaN      NaN  NaN        NaN
10  105       NaN        NaN      NaN  76.0     50.0    M        3.0
11  107       NaN        NaN      NaN  98.0     30.0    M        4.0

In [22]:
pd.merge(df1,df2,left_index = True, right_on = 'index_num')

  id_x      city birth_year     name id_y  math  english sex  index_num
0  100     Tokyo       1990  Hiroshi  100    50       90   M          0
1  101     Osaka       1989    Akiko  101    43       30   F          1
2  102     Kyoto       1992     Yuki  102    33       20   F          2
3  103  Hokkaido       1997   Satoru  105    76       50   M          3
4  104     Tokyo       1982   Steeve  107    98       30   M          4

##左外部結合（Left outer join）

In [23]:
pd.merge(df1,df2,how = 'left')

    id      city birth_year     name  math  english  sex  index_num
0  100     Tokyo       1990  Hiroshi  50.0     90.0    M        0.0
1  101     Osaka       1989    Akiko  43.0     30.0    F        1.0
2  102     Kyoto       1992     Yuki  33.0     20.0    F        2.0
3  103  Hokkaido       1997   Satoru   NaN      NaN  NaN        NaN
4  104     Tokyo       1982   Steeve   NaN      NaN  NaN        NaN
5  106     Tokyo       1991   Mituru   NaN      NaN  NaN        NaN
6  108     Osaka       1988      Aoi   NaN      NaN  NaN        NaN
7  110     Kyoto       1990    Tarou   NaN      NaN  NaN        NaN
8  111  Hokkaido       1995   Suguru   NaN      NaN  NaN        NaN
9  113     Tokyo       1981   Mitsuo   NaN      NaN  NaN        NaN

##縦結合（Vertical connection）

##データセット（Dataset）

In [24]:
data3 = {
    'id' : ['117','118','119','120','125'],
    'city':['Chiba','Kanagawa','Tokyo','Fukuoka','Okinawa'],
    'birth_year':[1990,1989,1992,1997,1982],
    'name':['Suguru','Kouichi','Satochi','Yukie','Akiri']
}

df3 = DataFrame(data3)
df3

    id      city  birth_year     name
0  117     Chiba        1990   Suguru
1  118  Kanagawa        1989  Kouichi
2  119     Tokyo        1992  Satochi
3  120   Fukuoka        1997    Yukie
4  125   Okinawa        1982    Akiri

##縦結合（Vertical connection）

In [25]:
concat_data = pd.concat([df1,df3])
concat_data

    id      city birth_year     name
0  100     Tokyo       1990  Hiroshi
1  101     Osaka       1989    Akiko
2  102     Kyoto       1992     Yuki
3  103  Hokkaido       1997   Satoru
4  104     Tokyo       1982   Steeve
5  106     Tokyo       1991   Mituru
6  108     Osaka       1988      Aoi
7  110     Kyoto       1990    Tarou
8  111  Hokkaido       1995   Suguru
9  113     Tokyo       1981   Mitsuo
0  117     Chiba       1990   Suguru
1  118  Kanagawa       1989  Kouichi
2  119     Tokyo       1992  Satochi
3  120   Fukuoka       1997    Yukie
4  125   Okinawa       1982    Akiri

#問題４（Question ４）
<br>以下の２つのデータテーブルに対して、内部結合しなさい。
<br>Inner join to the following two data tables.

In [26]:
data4 = {
    'id' : ['0','1','2','3','4','6','8','11','12','13'],
    'city':['Tokyo','Osaka','Kyoto','Hokkaido','Tokyo','Tokyo','Osaka','Kyoto','Hokkaido','Tokyo'],
    'birth_year':[1990,1989,1992,1997,1982,1991,1988,1990,1995,1981],
    'name':['Hiroshi','Akiko','Yuki','Satoru','Steeve','Mituru','Aoi','Tarou','Suguru','Mitsuo']
}

df4 = DataFrame(data4)
df4

   id      city  birth_year     name
0   0     Tokyo        1990  Hiroshi
1   1     Osaka        1989    Akiko
2   2     Kyoto        1992     Yuki
3   3  Hokkaido        1997   Satoru
4   4     Tokyo        1982   Steeve
5   6     Tokyo        1991   Mituru
6   8     Osaka        1988      Aoi
7  11     Kyoto        1990    Tarou
8  12  Hokkaido        1995   Suguru
9  13     Tokyo        1981   Mitsuo

In [27]:
data5 = {
    'id':['0','1','3','6','8'],
    'math':[20,30,50,70,90],
    'english':[30,50,50,70,20],
    'sex':['M','F','F','M','M'],
    'index_num':[0,1,2,3,4]
}

df5 = DataFrame(data5)
df5

  id  math  english sex  index_num
0  0    20       30   M          0
1  1    30       50   F          1
2  3    50       50   F          2
3  6    70       70   M          3
4  8    90       20   M          4

In [29]:
#ANSWER